zephyrproject-rtos/hal_nxp/dts/nxp/imxrt/imxrt5xx/pinctrl/MIMXRT595SFAWC-pinctrl.h
#undef LCDIF_dbi_data7_PIO5_2
#undef LCDIF_dbi_data8_PIO5_3
#undef LCDIF_lcdif_data10_PIO3_9
#undef LCDIF_lcdif_data11_PIO3_10
#undef LCDIF_lcdif_data12_PIO3_11
#undef LCDIF_lcdif_data13_PIO3_12
#undef LCDIF_lcdif_data14_PIO3_13
#undef LCDIF_lcdif_data15_PIO3_14
#undef LCDIF_lcdif_data16_PIO3_15
#undef LCDIF_lcdif_data17_PIO3_16
#undef LCDIF_lcdif_data18_PIO3_17
#undef LCDIF_lcdif_data19_PIO3_18
#undef LCDIF_lcdif_data20_PIO3_19
#undef LCDIF_lcdif_data20_PIO5_15
#undef LCDIF_lcdif_data21_PIO3_20
#undef LCDIF_lcdif_data21_PIO5_16
#undef LCDIF_lcdif_data22_PIO3_21
#undef LCDIF_lcdif_data22_PIO5_17
#undef LCDIF_lcdif_data23_PIO3_3
#undef LCDIF_lcdif_data23_PIO5_18
#undef LCDIF_lcdif_data5_PIO5_0
#undef LCDIF_lcdif_data6_PIO5_1
#undef LCDIF_lcdif_data7_PIO5_2
#undef LCDIF_lcdif_data8_PIO5_3
#undef LCDIF_lcdif_data9_PIO3_8
#undef LOW_FREQ_CLKOUT_N_PIO5_3
#undef LOW_FREQ_CLKOUT_PIO5_2
#undef MCLK_PIO1_10
#undef MCLK_PIO3_19
#undef PINT_PINT0_PIO1_10
#undef PINT_PINT0_PIO1_24
#undef PINT_PINT0_PIO1_25
#undef PINT_PINT0_PIO1_26
#undef PINT_PINT0_PIO1_27
#undef PINT_PINT0_PIO1_29
#undef PINT_PINT0_PIO1_30
#undef PINT_PINT0_PIO1_31
#undef PINT_PINT1_PIO1_10
#undef PINT_PINT1_PIO1_24
#undef PINT_PINT1_PIO1_25
#undef PINT_PINT1_PIO1_26
#undef PINT_PINT1_PIO1_27
#undef PINT_PINT1_PIO1_29
#undef PINT_PINT1_PIO1_30
#undef PINT_PINT1_PIO1_31
#undef PINT_PINT2_PIO1_10
#undef PINT_PINT2_PIO1_24
#undef PINT_PINT2_PIO1_25
#undef PINT_PINT2_PIO1_26
#undef PINT_PINT2_PIO1_27
#undef PINT_PINT2_PIO1_29
#undef PINT_PINT2_PIO1_30
#undef PINT_PINT2_PIO1_31
#undef PINT_PINT3_PIO1_10
#undef PINT_PINT3_PIO1_24
#undef PINT_PINT3_PIO1_25
#undef PINT_PINT3_PIO1_26
#undef PINT_PINT3_PIO1_27
#undef PINT_PINT3_PIO1_29
#undef PINT_PINT3_PIO1_30
#undef PINT_PINT3_PIO1_31
#undef PINT_PINT4_PIO1_10
#undef PINT_PINT4_PIO1_24
#undef PINT_PINT4_PIO1_25
#undef PINT_PINT4_PIO1_26
#undef PINT_PINT4_PIO1_27
#undef PINT_PINT4_PIO1_29
#undef PINT_PINT4_PIO1_30
#undef PINT_PINT4_PIO1_31
#undef PINT_PINT5_PIO1_10
#undef PINT_PINT5_PIO1_24
#undef PINT_PINT5_PIO1_25
#undef PINT_PINT5_PIO1_26
#undef PINT_PINT5_PIO1_27
#undef PINT_PINT5_PIO1_29
#undef PINT_PINT5_PIO1_30
#undef PINT_PINT5_PIO1_31
#undef PINT_PINT6_PIO1_10
#undef PINT_PINT6_PIO1_24
#undef PINT_PINT6_PIO1_25
#undef PINT_PINT6_PIO1_26
#undef PINT_PINT6_PIO1_27
#undef PINT_PINT6_PIO1_29
#undef PINT_PINT6_PIO1_30
#undef PINT_PINT6_PIO1_31
#undef PINT_PINT7_PIO1_10
#undef PINT_PINT7_PIO1_24
#undef PINT_PINT7_PIO1_25
#undef PINT_PINT7_PIO1_26
#undef PINT_PINT7_PIO1_27
#undef PINT_PINT7_PIO1_29
#undef PINT_PINT7_PIO1_30
#undef PINT_PINT7_PIO1_31
#undef PMIC_I2C_SCL
#undef PMIC_I2C_SDA
#undef SCT0_IN0_PIO1_10
#undef SCT0_IN0_PIO1_24
#undef SCT0_IN0_PIO1_26
#undef SCT0_IN0_PIO1_30
#undef SCT0_IN0_PIO1_31
#undef SCT0_IN0_PIO2_0
#undef SCT0_IN0_PIO2_1
#undef SCT0_IN0_PIO2_10
#undef SCT0_IN0_PIO2_11
#undef SCT0_IN0_PIO2_6
#undef SCT0_IN0_PIO2_7
#undef SCT0_IN0_PIO3_19
#undef SCT0_IN1_PIO1_10
#undef SCT0_IN1_PIO1_24
#undef SCT0_IN1_PIO1_26
#undef SCT0_IN1_PIO1_30
#undef SCT0_IN1_PIO1_31
#undef SCT0_IN1_PIO2_0
#undef SCT0_IN1_PIO2_1
#undef SCT0_IN1_PIO2_10
#undef SCT0_IN1_PIO2_11
#undef SCT0_IN1_PIO2_6
#undef SCT0_IN1_PIO2_7
#undef SCT0_IN1_PIO3_19
#undef SCT0_IN2_PIO1_10
#undef SCT0_IN2_PIO1_24
#undef SCT0_IN2_PIO1_26
#undef SCT0_IN2_PIO1_30
#undef SCT0_IN2_PIO1_31
#undef SCT0_IN2_PIO2_0
#undef SCT0_IN2_PIO2_1
#undef SCT0_IN2_PIO2_10
#undef SCT0_IN2_PIO2_11
#undef SCT0_IN2_PIO2_6
#undef SCT0_IN2_PIO2_7
#undef SCT0_IN2_PIO3_19
#undef SCT0_IN3_PIO1_10
#undef SCT0_IN3_PIO1_24
#undef SCT0_IN3_PIO1_26
#undef SCT0_IN3_PIO1_30
#undef SCT0_IN3_PIO1_31
#undef SCT0_IN3_PIO2_0
#undef SCT0_IN3_PIO2_1
#undef SCT0_IN3_PIO2_10
#undef SCT0_IN3_PIO2_11
#undef SCT0_IN3_PIO2_6
#undef SCT0_IN3_PIO2_7
#undef SCT0_IN3_PIO3_19
#undef SCT0_IN4_PIO1_10
#undef SCT0_IN4_PIO1_24
#undef SCT0_IN4_PIO1_26
#undef SCT0_IN4_PIO1_30
#undef SCT0_IN4_PIO1_31
#undef SCT0_IN4_PIO2_0
#undef SCT0_IN4_PIO2_1
#undef SCT0_IN4_PIO2_10
#undef SCT0_IN4_PIO2_11
#undef SCT0_IN4_PIO2_6
#undef SCT0_IN4_PIO2_7
#undef SCT0_IN4_PIO3_19
#undef SCT0_IN5_PIO1_10
#undef SCT0_IN5_PIO1_24
#undef SCT0_IN5_PIO1_26
#undef SCT0_IN5_PIO1_30
#undef SCT0_IN5_PIO1_31
#undef SCT0_IN5_PIO2_0
#undef SCT0_IN5_PIO2_1
#undef SCT0_IN5_PIO2_10
#undef SCT0_IN5_PIO2_11
#undef SCT0_IN5_PIO2_6
#undef SCT0_IN5_PIO2_7
#undef SCT0_IN5_PIO3_19
#undef SCT0_IN6_PIO1_10
#undef SCT0_IN6_PIO1_24
#undef SCT0_IN6_PIO1_26
#undef SCT0_IN6_PIO1_30
#undef SCT0_IN6_PIO1_31
#undef SCT0_IN6_PIO2_0
#undef SCT0_IN6_PIO2_1
#undef SCT0_IN6_PIO2_10
#undef SCT0_IN6_PIO2_11
#undef SCT0_IN6_PIO2_6
#undef SCT0_IN6_PIO2_7
#undef SCT0_IN6_PIO3_19
#undef SCT0_OUT0_PIO2_2
#undef SCT0_OUT1_PIO2_3
#undef SCT0_OUT2_PIO2_4
#undef SCT0_OUT3_PIO1_25
#undef SCT0_OUT3_PIO2_5
#undef SCT0_OUT4_PIO1_27
#undef SCT0_OUT4_PIO2_8
#undef SCT0_OUT5_PIO1_29
#undef SCT0_OUT5_PIO2_9
#undef SD0_CARD_DET_N_PIO2_9
#undef SD0_CLK_PIO1_30
#undef SD0_CMD_PIO1_31
#undef SD0_DS_PIO2_4
#undef SD0_RESET_N_PIO2_10
#undef SD0_VOLT_PIO2_11
#undef SD0_WR_PRT_PIO2_4
#undef SD1_CARD_DET_N_PIO3_19
#undef SD1_CLK_PIO3_8
#undef SD1_CLK_PIO4_11
#undef SD1_CMD_PIO3_9
#undef SD1_CMD_PIO4_12
#undef SD1_DS_PIO3_14
#undef SD1_RESET_N_PIO3_20
#undef SD1_VOLT_PIO3_21
#undef SD1_WR_PRT_PIO3_14
#undef SD1_WR_PRT_PIO4_17
#undef SMARTDMA_SMARTDMA_PIO0_PIO2_0
#undef SMARTDMA_SMARTDMA_PIO10_PIO2_10
#undef SMARTDMA_SMARTDMA_PIO11_PIO2_11
#undef SMARTDMA_SMARTDMA_PIO1_PIO2_1
#undef SMARTDMA_SMARTDMA_PIO28_PIO2_28
#undef SMARTDMA_SMARTDMA_PIO2_PIO2_2
#undef SMARTDMA_SMARTDMA_PIO3_PIO2_3
#undef SMARTDMA_SMARTDMA_PIO4_PIO2_4
#undef SMARTDMA_SMARTDMA_PIO5_PIO2_5
#undef SMARTDMA_SMARTDMA_PIO6_PIO2_6
#undef SMARTDMA_SMARTDMA_PIO7_PIO2_7
#undef SMARTDMA_SMARTDMA_PIO8_PIO2_8
#undef SMARTDMA_SMARTDMA_PIO9_PIO2_9
#undef USB1_PORTPWRN_PIO2_28
#undef USDHC0_USDHC_DATA0_PIO2_0
#undef USDHC0_USDHC_DATA1_PIO2_1
#undef USDHC0_USDHC_DATA2_PIO2_2
#undef USDHC0_USDHC_DATA3_PIO2_3
#undef USDHC0_USDHC_DATA4_PIO2_5
#undef USDHC0_USDHC_DATA5_PIO2_6
#undef USDHC0_USDHC_DATA6_PIO2_7
#undef USDHC0_USDHC_DATA7_PIO2_8
#undef USDHC1_USDHC_DATA0_PIO3_10
#undef USDHC1_USDHC_DATA0_PIO4_13
#undef USDHC1_USDHC_DATA1_PIO3_11
#undef USDHC1_USDHC_DATA1_PIO4_14
#undef USDHC1_USDHC_DATA2_PIO3_12
#undef USDHC1_USDHC_DATA2_PIO4_15
#undef USDHC1_USDHC_DATA3_PIO3_13
#undef USDHC1_USDHC_DATA3_PIO4_16
#undef USDHC1_USDHC_DATA4_PIO3_15
#undef USDHC1_USDHC_DATA4_PIO4_18
#undef USDHC1_USDHC_DATA5_PIO3_16
#undef USDHC1_USDHC_DATA6_PIO3_17
#undef USDHC1_USDHC_DATA7_PIO3_18
#undef UTICK0_CAPTURE2_PIO1_29

/* Signals specific to this part */
#define CTIMER1_MATCH3_PIO1_9 IOPCTL_MUX(41, 4)
#define DMA0_TRIG0_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA0_TRIG10_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA0_TRIG11_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA0_TRIG12_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA0_TRIG13_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA0_TRIG14_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA0_TRIG15_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA0_TRIG16_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA0_TRIG17_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA0_TRIG18_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA0_TRIG19_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA0_TRIG1_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA0_TRIG20_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA0_TRIG21_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA0_TRIG22_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA0_TRIG23_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA0_TRIG24_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA0_TRIG25_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA0_TRIG26_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA0_TRIG27_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA0_TRIG28_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA0_TRIG29_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA0_TRIG2_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA0_TRIG30_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA0_TRIG31_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA0_TRIG32_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA0_TRIG33_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA0_TRIG34_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA0_TRIG35_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA0_TRIG36_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA0_TRIG3_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA0_TRIG4_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA0_TRIG5_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA0_TRIG6_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA0_TRIG7_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA0_TRIG8_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA0_TRIG9_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA1_TRIG0_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA1_TRIG10_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA1_TRIG11_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA1_TRIG12_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA1_TRIG13_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA1_TRIG14_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA1_TRIG15_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA1_TRIG16_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA1_TRIG17_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA1_TRIG18_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA1_TRIG19_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA1_TRIG1_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA1_TRIG20_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA1_TRIG21_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA1_TRIG22_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA1_TRIG23_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA1_TRIG24_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA1_TRIG25_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA1_TRIG26_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA1_TRIG27_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA1_TRIG28_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA1_TRIG29_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA1_TRIG2_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA1_TRIG30_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA1_TRIG31_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA1_TRIG32_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA1_TRIG33_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA1_TRIG34_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA1_TRIG35_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA1_TRIG36_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA1_TRIG3_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA1_TRIG4_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA1_TRIG5_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA1_TRIG6_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA1_TRIG7_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA1_TRIG8_PIO1_9 IOPCTL_MUX(41, 0)
#define DMA1_TRIG9_PIO1_9 IOPCTL_MUX(41, 0)
#define FC5_SSEL3_PIO1_9 IOPCTL_MUX(41, 1)
#define GPIO_PIO19_PIO1_9 IOPCTL_MUX(41, 0)
#define GPIO_PIO627_PIO6_27 IOPCTL_MUX(219, 0)
#define HS_SPI1_SSELN3_PIO1_9 IOPCTL_MUX(41, 6)
#define MCLK_PIO6_27 IOPCTL_MUX(219, 1)
#define PINT_PINT0_PIO1_9 IOPCTL_MUX(41, 0)
#define PINT_PINT1_PIO1_9 IOPCTL_MUX(41, 0)
#define PINT_PINT2_PIO1_9 IOPCTL_MUX(41, 0)
#define PINT_PINT3_PIO1_9 IOPCTL_MUX(41, 0)
#define PINT_PINT4_PIO1_9 IOPCTL_MUX(41, 0)
#define PINT_PINT5_PIO1_9 IOPCTL_MUX(41, 0)
#define PINT_PINT6_PIO1_9 IOPCTL_MUX(41, 0)
#define PINT_PINT7_PIO1_9 IOPCTL_MUX(41, 0)
#define SCT0_IN0_PIO1_9 IOPCTL_MUX(41, 2)
#define SCT0_IN0_PIO6_27 IOPCTL_MUX(219, 1)
#define SCT0_IN1_PIO1_9 IOPCTL_MUX(41, 2)
#define SCT0_IN1_PIO6_27 IOPCTL_MUX(219, 1)
#define SCT0_IN2_PIO1_9 IOPCTL_MUX(41, 2)
#define SCT0_IN2_PIO6_27 IOPCTL_MUX(219, 1)
#define SCT0_IN3_PIO1_9 IOPCTL_MUX(41, 2)
#define SCT0_IN3_PIO6_27 IOPCTL_MUX(219, 1)
#define SCT0_IN4_PIO1_9 IOPCTL_MUX(41, 2)
#define SCT0_IN4_PIO6_27 IOPCTL_MUX(219, 1)
#define SCT0_IN5_PIO1_9 IOPCTL_MUX(41, 2)
#define SCT0_IN5_PIO6_27 IOPCTL_MUX(219, 1)
#define SCT0_IN6_PIO1_9 IOPCTL_MUX(41, 2)
#define SCT0_IN6_PIO6_27 IOPCTL_MUX(219, 1)
#define UTICK0_CAPTURE1_PIO1_9 IOPCTL_MUX(41, 3)

#endif /* _ZEPHYR_DTS_BINDING_MIMXRT595SFAWC_WRAPPER_ */
